[
{"articles": ["At Republic Bank your health and well-being, and that of our staff and communities, are always our main priority. In light of the current COVID-19 pandemic, we assure you that we remain committed to providing the banking services you need in the safest environments possible.Following the guidelines outlined by our public health authorities and the World Health Organization, we have increased the sanitization of all high-traffic touch points at our branches and provided personal sanitizing agents in our customer areas.As we each do our part in limiting the spread of the Covid-19 virus and in line with the urgings of the authorities around social distancing we request that customers consider minimizing their visits to the bank’s branches where possible by:Utilizing the Bank’s digital and electronic channelsRepublicOnlineRepublicMobileATMsUsing your debit and credit cards at Point-of-Sale terminals instead of cashContacting us at (264) 498-2265 to find out how we may facilitate your banking needs via telephonePostponing transactions if not criticalIf you are under quarantine or experiencing flu-like symptoms, please do not visit banking halls. We are ready and willing to meet your banking needs through any of the channels listed above.We encourage you to continue to observe the recommended hygienic practices to help prevent the spread of the virus; and to be mindful of those who may be more vulnerable around you. By observing these practices and working together, we can help protect our families, our communities and each other.Thank you for your understanding.Sincerely,Michelle PalmerManaging Director"]},
{"articles": ["We are pleased to advise that effective Monday, May 4, 2020, and until further notice, we will resume regular opening hours and our full suite of products and services will be available.OPENING HOURSMonday - Thursday: 8:00 a.m. - 2:00 p.m.Friday: 8:00 a.m. - 4:00 pmSocial DistancingWe will continue to observe social distancing guidelines by restricting branch traffic to 8 persons at a time.Please remember to maintain a distance of at least 6 feet from one another when inside and outside your branch.Remember, our electronic and digital banking services are available 24/7. Please use them instead of visiting the branch, whenever possible.Thank you for your cooperation as we work together to safeguard your health during the COVID-19 pandemic."]}
]